Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: With this function you can change or set the position of the mouse within the game window which can be useful for FPS games, for example.
zh_cn: 有了这个函数，你可以更改游戏窗口的鼠标位置，这在FPS游戏中非常有用。

source: With this function you can change or set the windows caption for the room that you are currently in.
zh_cn: 有了这个函数，你可以更改或设置当前所在房间的窗口标题。

source: With this function you can change the size of the game window.
zh_cn: 有了这个函数，你可能更改游戏窗口的大小。

source: With this function you can check to see if two arrays are equal (equivalent or the same).
zh_cn: 使用该函数你可以检测两个数组是否相等（等价或一致）

source: With this function you can copy the contents of one grid into another one.
zh_cn: 使用这个函数你能够把一个栅格内的内容复制给另一个。

source: With this function you can create an array of a given size.
zh_cn: 使用该函数，你可以创建一个给定长度的数组。

source: With this function you can enable or disable the application surface.
zh_cn: 可以用这个函数启用或禁用应用表面层。

source: With this function you can find the overlapping region of the rectangle defined by (x1,y1) to (x2,y2) on each of the attached displays.
zh_cn: 使用这个函数你可以查找 (x1,y1) 到 (x2,y2)矩形范围内的每个附加显示器的重叠区域。

source: With this function you can get the current cursor being used in the game window, with the return value being any one of the constants listed below (to set the current cursor being used you can use the function window_set_cursor which also takes these constants):
zh_cn: 可以用这个函数获得当前游戏窗口使用的鼠标指针，返回值将下面所列的常量中的一个（设置当前的鼠标指针可以使用这个函数 window_set_cursor ，同样也是使用下面的常量）：

source: With this function you can get the current height (in pixels) of the game window.
zh_cn: 这个函数可以获取游戏窗口的高度（像素为单位）。

source: With this function you can get the current width (in pixels) of the game window.
zh_cn: 通过这个函数获取游戏窗口当前宽度（像素为单位）。

source: With this function you can get the height (number of entries) of a the first dimension of a 2D array.
zh_cn: 使用该函数你可以得到一个二维数组的高度（以数组元素的个数形式）。

source: With this function you can get the internal Windows id value (the HWND, a pointer).
zh_cn: 使用该函数您能获取到内部Windows内部id值（HWND，一个指针）。

source: With this function you can get the length (number of entries) of a 1D array.
zh_cn: 使用该函数你可以得到一个一维数组的长度（以数组元素的个数形式）。

source: With this function you can get the length (number of entries) of a the second dimension of an array.
zh_cn: 使用该函数你可以得到一个二维数组的高度（以数组元素的个数形式）。

source: With this function you can get the value from a given named global variable.
zh_cn: 使用该函数你可以从所给定全局变量名的变量中的值。

source: With this function you can get the x position (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or MacOS game.
zh_cn: 通过这个函数，你将获取HTML5游戏浏览器内窗口的x坐标，或者者Windows, Ubuntu (Linux) 或者 MacOS 游戏显示屏内的窗口坐标。

source: With this function you can get the x position of the mouse cursor (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or MacOS game.
zh_cn: 使用该函数您可以获取到鼠标光标在显示器上（Windows、Ubuntu(Linux)及MacOS平台）的x坐标（像素为单位），如果是HTML5平台则是在浏览器中的位置。

source: With this function you can get the y position (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or MacOS game.
zh_cn: 通过这个函数，你将获取HTML5游戏浏览器内窗口的y坐标，或者者Windows, Ubuntu (Linux) 或者 MacOS 游戏显示屏内的窗口y坐标。

source: With this function you can get the y position of the mouse cursor (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or MacOS game.
zh_cn: 使用该函数您可以获取到鼠标光标在显示器上（Windows、Ubuntu(Linux)及MacOS平台）的y坐标（像素为单位），如果是HTML5平台则是在浏览器中的位置。

source: With this function you can poll the window (or tab) state and if it loses focus the function will return false otherwise it will return true.
zh_cn: 使用这个函数您能够得到窗口（或标签页）的状态，如果它失焦的时候，该函数会返回false，反之则返回true。

source: With this function you can send a request to connect to a server.
zh_cn: 您能够使用该函数发送一个连接服务器的请求。

source: With this function you can set the cursor for the game window to any one of the constants listed below (to find the current cursor being used you can use the function window_get_cursor which will also return one of these constants):
zh_cn: 有了这个函数，你可以设置游戏窗口的光标为下面列出的任意一个常量（获取当前使用的光标可以使用函数window_get_cursor ，它将返回这些常量中的一个）：

source: With this function you can set the game window to a specific position within the display (on MacOS, Linux(Ubuntu) and Windows) or within the browser (HTML5).
zh_cn: 有了这个函数，你可以设置游戏窗口至显示器内的特定位置 （适用 MacOS, Linux（Ubuntu） 和 Windows） 或者浏览器内 （HTML5）。

source: With this function you can set the game window to be full screen (true) or not (false).
zh_cn: 有了这个函数，你可以设置游戏窗口为全屏幕（true）或者不是全屏（false）。

source: With this function you can set the position of the game window within the browser (HTML5) or display (Windows, Ubuntu (Linux) or MacOS) and set the scale of the window too.
zh_cn: 有了这个函数，你可以设置浏览器内（HTML5）或者显示器内（Windows、 Ubuntu （Linux）或者 MacOS）游戏窗口的位置和 大小。

source: With this function you reset all further drawing from the target surface back to the screen.
zh_cn: 用这个函数重置后面所有的绘制，从目标表面层返回到屏幕上。

source: With this method you could focus test with someone else or, as the designer, get a better feel for things by doing side-by-side tests.
zh_cn: 用这种方法，你可以与其他人一起进行测试，或者最为设计人员的你，可以通过并行测试来更好地了解游戏。

source: With this option you can choose to have the message show, have it update the layers as if you'd clicked "Ok", or have it not update anything as if you'd clicked "No".
zh_cn: 使用这个选项你可以选择显示消息，如果单击“Ok（确定）”它会更新层，单击“No（否）”将不会自动更新。

source: With this option you can convert from one to the other, regardless of the project type.
zh_cn: 使用此选项，无论项目类型如何，都可以将其从一个转换为另一个。

source: With those details given you can then click on the Create Certificate button to generate the *.pem file.
zh_cn: 鉴于那些给你的细节，你可以点击创建证书 按钮生成*.pem 文件。

source: Within the Marketplace dashboard you can set up different publishers if you require and each one should have it's own corresponding *.pem certificate file.
zh_cn: 如果你需要，在市场面板里可以设置不同的开发者，每一个都应该拥有对应的*.pem 证书文件。

source: Words
zh_cn: 字

source: Worker
zh_cn: 工作者

source: Worker:
zh_cn: 工作者：

source: Workflow
zh_cn: 工作流程

source: Workflow Guide
zh_cn: 工作流程指导

source: Workspace
zh_cn: 工作区

source: Workspace Overview
zh_cn: 工作区概述

source: Workspace chain column padding (px)
zh_cn: 工作区链条连接的面板之间的列间隔量 (px)

source: Workspace chain link colour
zh_cn: 工作区链条连接颜色

source: Workspace chain rendering segment count
zh_cn: 工作区链条渲染段计数

source: Workspace chain row padding (px)
zh_cn: 工作区链条连接的面板之间的行间隔量(px)

source: Workspace chains can overlap
zh_cn: 允许工作区链条连接交叉

source: Workspace keyboard navigation degree range
zh_cn: 工作区键盘导航度范围(?)

source: Workspace keyboard navigation resets zoom
zh_cn: 工作区键盘导航会重置缩放

source: Workspace {0}
zh_cn: 工作区 {0}

source: Workspaces
zh_cn: 工作区

source: Would you like to add them?
zh_cn: 你要添加它们吗？

source: Would you like to download this manual?
zh_cn: 您想下载本帮助文档吗？

source: Would you like to import as {2} instead?
zh_cn: 你想要改成导入为{2}吗？

source: Would you like to overwrite it?
zh_cn: 你要覆盖它吗？

source: Would you like to reload the project, or save?\n\nWARNING: Save will only update the resources files that are currently held in memory, and therefore may not restore some deleted or edited files
zh_cn: 你想要重新加载项目，还是保存呢？\n\n警告：保存只会更新当前内存中的资源文件，因此可能不会恢复一些删除或编辑过的文件。

source: Would you like to reload the project?
zh_cn: 您希望重新载入工程吗？

source: Would you like to reload the resources, or save?\n\nWARNING: Save will only update the resources files that are currently held in memory, and therefore may not restore some deleted or edited files
zh_cn: 你想要重新加载项目，还是保存呢？n\n警告：保存只会更新当前内存中的资源文件，因此可能不会恢复一些删除或编辑过的文件。

source: Wrap
zh_cn: 卷动

source: Wrap Around Room
zh_cn: 在房间内卷动

source: Wrap Frames
zh_cn: 帧卷动(?)

source: Wrap around room.
zh_cn: 在房间内循环卷动，离开房间时移动到房间另外一边。

source: Write
zh_cn: 写

source: Write Buffer
zh_cn: 写入缓冲区

source: Write Errors
zh_cn: 写入错误

source: Write To Ini File
zh_cn: 写入ini文件

source: Write a string or numeric value to an ini file.
zh_cn: 往一个ini文件中写入字符串或数字。

source: Write new library name
zh_cn: 写新库名

source: Write to a buffer.
zh_cn: 向缓冲区中写入。

source: X And Y
zh_cn: X 和 Y

source: X Coordinate
zh_cn: X坐标

source: X Offset
zh_cn: X偏移值

source: X Only
zh_cn: 仅X

source: X Pos
zh_cn: X 位置

source: X Spacing
zh_cn: X 间距

# XBox One tools not available on Mac. Please edit on Windows
source: XBox One tools not available on Mac.\nPlease edit on Windows
zh_cn: XBox One 工具在Mac不可用。\n请在Windows上编辑。

source: XDK Directory
zh_cn: XDK 目录

source: XDK location
zh_cn: XDK 位置

source: XWindow handle
zh_cn: XWindow句柄

source: Xbox One SDK location
zh_cn: Xbox One SDK 位置

source: Xbox One Tools Directory
zh_cn: Xbox One 工具目录

source: Xbox One Tools Missing
zh_cn: Xbox One Tools 缺失

source: Xbox One Tools location
zh_cn: Xbox One Tools 位置

source: Xbox One X title memory (GB)
zh_cn: Xbox One X 内存使用(GB)

source: Xcode 7 or higher
zh_cn: Xcode 7或更高

source: Y Coordinate
zh_cn: Y坐标

source: Y Offset
zh_cn: Y偏移值

source: Y Only
zh_cn: 仅Y

source: Y Pos
zh_cn: Y 位置

source: Y Spacing
zh_cn: Y 间距

source: YYZ Export Failed
zh_cn: YYZ导出失败

source: YYZ Exported Successfully
zh_cn: YYZ导出成功。

source: YYZ Exporter
zh_cn: YYZ导出器

source: YYZ Importer
zh_cn: YYZ 导入器

source: Yahoo
zh_cn: 雅虎

source: Yes
zh_cn: 是

source: YoYo Account Login
zh_cn: YoYo帐户登录

source: YoYoGames.com
zh_cn: YoYoGames官网

source: You could use a tilemap, but given that tilemaps are restricted to using a grid and only a single image per grid cell, they can be a bit restrictive.
zh_cn: 虽然 可以 使用图块，但是由于图块限制必须使用网格而每个网格单元只能有一个图像，所以图块映射层会产生限制。

source: You also have a couple of specialist functions that are designed only for use with the application surface:
zh_cn: 你也有只为应用表面专门设计的函数可以使用：

source: You also merge these secondary workspace windows back into the main one by dragging the tab back onto the first window.
zh_cn: 您还可以将这些辅助工作区窗口通过将标签拖回到第一个窗口，来将其重新整合到主窗口中。

source: You are about to delete the directory "{0}" and all the items it contains.
zh_cn: 您将要删除目录"{0}"以及它所包含的所有项目。

source: You are about to delete the file "{0}".
zh_cn: 你将要删除文件"{0}"。

source: You are about to remove ""{0}"" from view ""{1}"".
zh_cn: 您正要从视野 ""{1}""中删除""{0}""。

source: You are logged into too many devices at once; manage devices and sessions on our website
zh_cn: 你一次登录太多设备；请在我们网站上管理设置和会话。

source: You are not actually passing the array itself into the script (as you would a variable), but instead you are requesting that the script create a copy of this array, which you will change in the script.
zh_cn: 你不是传递这个数组自身（数组变量），代替的是要求脚本创建这个数组的拷贝（副本），脚本中可以随意更改。

source: You are not editing an action.
zh_cn: 你没有在编辑动作。

source: You are not previewing an action.
zh_cn: 你没有在预览一个动作。

source: You are performing a one-way conversion from DnD™ to GameMaker Language.
zh_cn: 你正在执行一个 从DnD™ 到 GML的单向转换。

source: You are presented with a list of everything and as you type the search term, this list will be culled to suit, so if all your rooms are prefixed with "rm_" for example, typing that will cull the resource list to show only those resources that begin with that name.
zh_cn: 你会看到一个列举了全部东西的列表，并且随着你键入搜索项，该列表就会进行适配筛选，所以如果你的所有房间的名称都用"rm_"前缀，键入"rm_"就会筛选资源列表并仅显示以这个名字开头的资源。

source: You are using a reference to an argument that does not exist but that could map to another argument (for more information on scripts and arguments see here)
zh_cn: 你正在引用一个不存在的参数，但该引用可以映射到另一个参数（有关脚本和参数的更多信息，请参阅 这里）

source: You assign the array to a variable, and then "fill in" different indices of the array with values.
zh_cn: 你可以将数组赋予给一个变量，然后用值“填入”数组的各个索引元素中。

source: You can not edit most of the other information here (as it is set through the Target Manager Devices settings, but you can change the Network Speed value.
zh_cn: 你不可以编辑此处的大部分信息（因为它们是通过目标管理器设备（Target Manager Devices）被设定好的，但是你可以修改网络速度（Network Speed）值）。

source: You can add breakpoints using the key "F9", and they will be shown in the Output Window where you can enable/disable them as required.
zh_cn: 您可以使用快捷键 F9 添加断点，它们将显示在 输出窗口 中，您可以根据需要启用/禁用它们。

source: You can add up to 10 "bookmarks" to IDE windows or sections of code in scripts or object events, and then you can quickly skip between them using the correct key combination.
zh_cn: 您可以将最多10个“书签”添加到 IDE 窗口，脚本或物体事件中的代码中，然后便可以使用正确的组合键快速在它们之间切换。

source: You can also Add a new SSH keypair authentication by clicking the button with that label.
zh_cn: 你还可以通过单击具有 SSH 标签的按钮 添加以 SSH 密钥验证身份的账户 。

source: You can also add or subtract one from a value using ++, --.
zh_cn: 你甚至可以用以下符号加减一 ： ++，--。

source: You can also assign values to the enum variables at the time of creation:
zh_cn: 你也可以在制作过程中将值赋给枚举变量：

source: You can also create a sprite to be used as a tile set, but we'll explore that option later too.
zh_cn: 您也可以创建一个精灵来用作 图块集，我们稍后也会详细介绍这个选项。

source: You can also delete an array simply by "re-assigning" the variable that defines it to a single value.
zh_cn: 删除一个数组仅需要对定义它的变量重新赋予一个值。

source: You can also delete views using the button (this is not available for the default view) and views can be renamed by simply clicking on the name and entering the new name you require.
zh_cn: 您也可以使用按钮 删除视图（不可用于默认视图），只需点击名称并输入所需的新名称即可重命名视图。

source: You can also edit the sprite resource image that has been assigned by clicking the Edit Image button to open the Image Editor.
zh_cn: 您还可以通过单击编辑图像按钮来编辑已分配的精灵资源图像以打开图像编辑器。

source: You can also run the game in Debug Mode by testing using the Debug button .
zh_cn: 您也可以通过使用 调试模式 按钮进行测试来运行游戏 。

source: You can also see in the image above the Output Window.
zh_cn: 您可以在上方的图像中看到 输出窗口。

source: You can also set the speed to follow the path and a number of other actions relating to the position and orientation of the path within the room.
zh_cn: 同时你也可以设置沿路径运动时的速度，以及在运动到不同位置及方向时执行不同的动作。

source: You can also set this variable to effectively turn "on" or "off" a view by setting the value to true (visible) or false (invisible).
zh_cn: 可以通过设置这个变量的值的true (可见) or false (不可见)，来“打开”或“关闭”一个视野。

source: You can also specify the precision for the curves (default is 4) which can be from 1 to 8 with 8 being the smoothest.
zh_cn: 同时你可以设置曲线的平滑程度（默认是4），范围是1至8，其中8最为平滑。

source: You can also split the main watch area into multiple windows using the "Split" option from the top window bar, permitting you to organise the layout to suit your needs (and these layouts can also be saved through the "Window" drop down menu).
zh_cn: 你也可以使用窗口顶端的横条中的“Split”功能把主窗口区域划分成多个窗口，这个操作允许你组织布局来满足你的需求（而这些布局也可以通过顶端下拉菜单“Window”来存储）。

source: You can also supply a string or value to use to replace the search term if found.
zh_cn: 条件允许的话您也可以使用字符串或某个值来作为搜索词进行搜索。

source: You can also update the runtime list at any time from the given RSS feed clicking the refresh button .
zh_cn: 你也可以在任何时间通过点击刷新按钮更新运行库列表。.

source: You can also zoom the workspace in and out using the + the mouse wheel .
zh_cn: 你也可以使用快捷键 + 鼠标滚轮 缩放工作区。

source: You can also zoom the workspace in and out using the / + the mouse wheel .
zh_cn: 你还可以使用 / +鼠标滚轮 放大和缩小工作区。

source: You can assign your audio file to a specific Audio group.
zh_cn: 你可以将你的音频文件分到一个特定的 Audio group (音频组)。

source: You can change these setting to show the message always or dismiss it with a specific action (either Yes or No) :
zh_cn: 此选项允许您禁止此消息，并取消导入（“否”），或覆盖当前的精灵（“是”）。 默认值为“显示消息”。

source: You can choose either "Frames per second" or "Frames per game frame", with the default setting being "Frames per second".
zh_cn: 你可以选择“帧每秒”或者“帧每游戏帧”，默认设置是“帧每秒”。

source: You can choose to let the IDE decide by selecting Use Default, or you can force it On or Off by selecting either of those options.
zh_cn: 你可以选择使用默认（Use Default）来让IDE决定，也可以通过选择相应选项来强制它开启（On）或关闭（Off）。

source: You can click New to create a new project, Open to open an existing project or Import to open a GameMaker: Studio 1.4 GMX project file or to open a compressed YYZ GameMaker Studio 2 project file.
zh_cn: 你可以点击 新建（New） 创建一个新的工程，打开（Open） 来打开一个外部工程或者 导入（Import） 打开一个 GameMaker: Studio 1.4的GMX 工程文件，或者打开压缩的 YYZ格式的GameMaker Studio 2 工程文件。

source: You can click any of the lines of text that are shown and you will be taken directly to the object or script that has thrown the error, and then you can use the information contained within the message to pinpoint exactly where in the object or script the error has occurred.
zh_cn: 点击弹窗中的任意条目将打开该错误对应的物体或脚本，你可以根据错误提示定位错误在物体或脚本的位置。

source: You can click the colour swatch to open the colour editor and change it.
zh_cn: 你可以点击颜色卡来打开颜色编辑器去改变它。

source: You can click the middle mouse button or press on any of the scripts listed in the report to open it and see what has been done.
zh_cn: 您可点击鼠标中键You can click the middle mouse button or press on any of the scripts listed in the report to open it and see what has been done.

source: You can click the right mouse button on any event to get the following menu options:
zh_cn: 任何事件都可以单击鼠标右键获取以下菜单选项：

source: You can close the sound editor now and we can move on to creating Objects...
zh_cn: 你现在可以关闭声音编辑器了，我们来继续创建物体...

source: You can close the sprite editor now as we are going to move on to discuss Tile Sets.
zh_cn: 现在您可以关闭精灵编辑器了，因为我们将继续讨论 图块集。

source: You can create multiple notes and name them from the right mouse button menu in the resource tree.
zh_cn: 你可以右键资源树菜单来创建多个便签并为其命名。

source: You can delete them (clear all of them so that you can create a new watch layout), or save the current layout or load a previously saved layout.
zh_cn: 你可以把它们全删掉（把它们全部清理掉你就能获得一个全新的窗口布局），或者把当前的布局存起来再或者读取以前存储的布局。

source: You can directly access these built in argument variables, or you can assign them to temporary (local) variables as we have done in the example above (using temporary variables makes it easier to follow what each one does, and is recommended).
zh_cn: 你可以直接访问这些内置的argument变量，或者将其赋给临时（局部）变量就像我们在上面范例中所做的那样（使用临时变量会使跟踪每一个参数的行为更加容易，并且这是推荐的做法）。

source: You can disable them here, and they are on by default.
zh_cn: 你可以在此处禁用他们，它们默认是打开的。

source: You can double click either of them to bring up the different versions of your game, and having them as batch files means that you can easily open them again to edit them and change the game being tested.
zh_cn: 你可以双击 其中任何一个来打开你的游戏的不同版本，将它们作为批处理文件意味着你可以轻松地再次打开它们来编辑它们并修改为需要测试的游戏。

source: You can download the GameMaker Studio 2 installer from the YoYo Games Website.
zh_cn: 你可以从 YoYo Games Website下载GameMaker Studio 2的安装包。

source: You can find a complete list of the required tools and SDKs per platform from the following link:
zh_cn: 你可以在下面的链接中找到每个平台所要求的工具及SDK的完整列表：

source: You can find a list of these functions from the following section of the manual:
zh_cn: 你可以在如下章节中找到这些函数的列表：

source: You can find further information on the sound editor here.
zh_cn: 你可以在 这里 找到更多关于声音编辑器的信息。

source: You can find more about the debug module from the section on the Debugger.
zh_cn: 您可以从 Debugger 部分找到有关调试模块的更多信息。

source: You can find more information about GML here.
zh_cn: 关于 GML 更多的详细信息在这里.

source: You can find out further information about the Debug Module and its possibilities and how to use it from the following page:
zh_cn: 您可以从以下页面中找到有关调试模块的更多信息以及如何使用它们：

source: You can find out further information about the YYA from the following page:
zh_cn: 你可以在下面的页面中找到关于YYA的详细信息。

source: You can find out how to use DnD™ from the following sections of the manual:
zh_cn: 在手册的以下章节，你可以找到 DnD™ 的使用方法：

source: You can find out more about adding extensions from the section on the Extension Editor.
zh_cn: 您可以从 扩展编辑器 的部分中找到有关添加扩展的更多信息。

source: You can find out more about adding files from the section on Included Files.
zh_cn: 您可以从包含文件部分找到有关包含文件的更多信息。

source: You can find out more about adding fonts from the section on the Font Editor.
zh_cn: 您可以在 字体编辑器 部分找到更多相关信息。

source: You can find out more about adding notes from the section on the Notes Editor.
zh_cn: 您可以从 注释编辑器 的部分中找到有关添加注释的更多信息。

source: You can find out more about adding objects from the section on the Object Editor.
zh_cn: 您可以在 物体编辑器 部分找到更多相关信息。

source: You can find out more about adding paths from the section on the Script Editor.
zh_cn: 您可以在 脚本编辑器 部分找到更多相关信息。

source: You can find out more about adding paths from the section on the Path Editor.
zh_cn: 您可以在路径编辑器部分中找到其他相关信息。

source: You can find out more about adding rooms from the section on the Room Editor.
zh_cn: 您可以从 房间编辑器 中找到更多相关的信息。

source: You can find out more about adding shaders from the section on the Shader Editor.
zh_cn: 你可以在Shader Editor着色器编辑器 部分找到更多相关信息。

source: You can find out more about adding sounds from the section on the Sound Editor.
zh_cn: 你可以在 声音编辑器 部分找到更多有关信息。

source: You can find out more about adding sprites from the section on the Sprite Editor.
zh_cn: 您可以从 精灵编辑器 部分中了解更多关于添加和编辑精灵的信息。

source: You can find out more about adding tile sets from the section on the Tile Set Editor.
zh_cn: 您可以从 图块集编辑器 部分中找到有关添加图块集的更多信息。

source: You can find out more about adding timelines from the section on the Timeline Editor.
zh_cn: 您可以在 时间轴编辑器 部分找到更多相关信息。

source: You can find out more about setting up and compiling to UWP platform from the YoYo Games Help Center.
zh_cn: 您可以在 YoYo游戏帮助中心了解有关设置和编译到 UWP 平台的更多信息。

source: You can find out more about the Marketplace from the section on the GameMaker Marketplace, and the options from this menu are given below:
zh_cn: 在 GameMaker 市场 一节中你可以找到更多关于市场的信息，此菜单的选项如下所示：

source: You can find out more from the YoYo Games Help Center.
zh_cn: 您可以在 YoYo游戏帮助中心 了解更多信息。

source: You can find out more from the YoYo Games Help Center
zh_cn: 您可以在 YoYo游戏帮助中心 了解更多信息。

source: You can find out more information from the YoYo Games helpdesk here: Setting Up For Web (HTML5).
zh_cn: 你可以从YoYo游戏知识库找到更多的信息：Web（HTML5）设置。

source: You can find out more information on accessors and how they work, along with an example for arrays, from the following page:
zh_cn: 关于它的用法，访问器这一节可以找到更多的信息和数组的例子，详情访下面的页面：

source: You can find out more information on performance issues and ways to optimise your game on the YoYo Games Help Center - Optimising Your Games.
zh_cn: 您可以在 YoYo Games 帮助中心 - 优化您的游戏 中找到有关性能问题和优化游戏的方法的更多信息。

source: You can find the current release notes for the IDE from the link below:
zh_cn: 你可以通过下面的链接查看当前IDE的发行信息：

source: You can find the current release notes for the Runtimes from the link below:
zh_cn: 你可以通过下面的链接查看当前的运行环境发行信息

source: You can find the licence agreement in the install folder for GameMaker Studio 2, typically "C:\Program Files\GameMaker Studio 2\Licence.txt".
zh_cn: 您可以在 GameMaker Studio 2, 的安装文件夹中找到许可协议，路径通常为 “C:\Program Files\GameMaker Studio 2\Licence.txt”。

source: You can get the number of entries for the second dimension of the array using the function array_length_2d.
zh_cn: 你可以使用函数array_length_2d来得到数组的第二个维度元素个数。

source: You can log out from the File Menu.
zh_cn: 你可以从 文件菜单 中登出。

source: You can not bind global inputs to a function that takes paramaters.
zh_cn: 您不能将全局输入绑定到带参数的函数上。

source: You can now add in your proxy details.
zh_cn: 现在你可以添加你的代理的详细信息。

source: You can now close the tile set editor, as you can use the tile set "as is" to create tilemap layers in the room editor.
zh_cn: 您现在可以关闭图块集编辑器，并且您可以使用图块集“按原样”在房间编辑器中创建图块图层。

source: You can now edit the code to give your object a specific behaviour or reaction to that event.
zh_cn: 您现在可以编辑代码，为您的对象提供特定的行为或对该事件的反应。

source: You can only add a single tile to each grid cell, so if you require multiple tiles to occupy the same space, then you should be using multiple tilemap layers.
zh_cn: 您只能为每个网格单元添加一个图块，因此如果您需要使多个图块占据相同的空间，则应该使用多个图块映射层。

source: You can only have 1 ini file open at a time.
zh_cn: 你只能同时打开一个ini文件。

source: You can open the GameMaker Studio 2 Preferences from the File menu at the top left of the IDE:
zh_cn: 你可以通过IDE顶端的文件（File）菜单来打开GameMaker Studio 2的偏好设置：

source: You can perform certain operations on strings, like add two strings together to create a longer string (concatenation) and you can also change the string properties and even extract real numbers from it.
zh_cn: 你可以对字符串执行某些操作，例如将它们叠加到一起形成一段更长的字符串（串接操作（Concatenation）），你也可以改变字符串的属性甚至从中抽取实数部分。
